#pragma strict
//-------------------------------------------
//	地刺脚本，效果是几秒一出现几秒一消失
//-------------------------------------------
//	定义内容
//-------------------------------------------
var homePoint	: Vector3;						//起始点,记忆物体的位置
var spikeClose	: boolean = false;				//设定地刺是否关闭，关闭就隐藏起来，默认是关闭的
var soundClose	: AudioClip;					//关闭和开启的音效
//-------------------------------------------
//	计时器相关
//-------------------------------------------
var rateF		: float	  = 2.8;							//设置多少秒一次执行
private var nextF = 0.0;						//不需要改变它
//-------------------------------------------
//	程序执行前加载的
//-------------------------------------------
function Start () 
{
	homePoint = transform.position;	//记忆初始点
}
//-------------------------------------------
//	每秒都会运行的
//-------------------------------------------
function Update () 
{
	countDown();							//自动启用倒计时函数
	//---------------------------------------
	//	地刺开启和关闭的判断
	//---------------------------------------
	if (spikeClose)
		transform.position.y = -10;		//将物体Y坐标往下移动200进行假隐藏
	else
		transform.position = homePoint;		//将物体位置移动回来
}
//-------------------------------------------
//	倒计时函数
//-------------------------------------------
function countDown()
{
	if (Time.time > nextF)
	{
		nextF = Time.time + rateF;
		//-----------------------------------
		//	下面是执行程序
		//	判定地刺的状态如果打开就关闭
		//-----------------------------------
		if (spikeClose)
		{
			spikeClose = false;
		}
		else
		{
			GetComponent.<AudioSource>().clip = soundClose;
			GetComponent.<AudioSource>().Play();				//音效
			spikeClose = true;	
		}	
	}
}